#include <iostream>
#include <string>
#include <cstring>
#include <cstdlib>
#include <ctime>
#include <cstdio>
#include <algorithm>
#include <windows.h>
#include <conio.h>
using namespace std;
int off_in_i,sr_d[150] = {48463,48473,48479,48481,48487,48491,48497,48523,48527,48533,48539,48541,48563,48571,48589,48593,48611,48619,48623,48647,48649,48661,48673,48677,48679,48731,48733,48751,48757,48761,48767,48779,48781,48787,48799,48809,48817,48821,48823,48847,48857,48859,48869,48871,48883,48889,48907,48947,48953,48973,48989,48991,49003,49009,49019,49031,49033,49037,49043,49057,49069,49081,49103,49109,49117,49121,49123,49139,49157,49169,49171,49177,49193,49199,49201,49207,49211,49223,49253,49261,49277,49279,49297,49307,49331,49333,49339,49363,49367,49369,49391,49393,49409,49411,49417,49429,49433,49451,49459,49463,49477,49481,49499,49523,49529,49531,49537,49547,49549,49559,49597,49603,49613,49627,49633,49639,49663,49667,49669,49681,49697,49711,49727,49739,49741,49747,49757,49783,49787,49789,49801,49807,49811,49823,49831,49843,49853,49871,49877,49891,49919,49921,49927,49937,49939,49943,49957,49991,49993,49999};
//使用150个质数作为临时随机数种子 
struct player{
    string name;
    int HP/*血量*/,At/*攻*/,Pt/*防*/,Sp/*速*/,Se/*敏*/,Ma/*魔*/,Re/*抗*/,Wi/*智*/,team/*队伍*/ ;
    long double Ma_st/*魔攻命中率*/,Ph_at/*物攻命中率*/,De/*防御率*/,Av/*回避率*/;
}s[1000];
void say(string a){ 
    for(int i = 0;i < a.length();i++){
        if(a[i] == 'e'){
            cout << endl;
        }else{
            cout << a[i];
        }
        Sleep(20);
    }
    printf("\n");
}
void start_game(){//开始游戏 

}
void fz(string j,int i){//根据名字生成参数 
    char p[40]; 
    j.copy(p,j.length(),0); 
    *(p + j.length()) = '/0';//将string转成char好操作 
    long lhp = 0;
    for(int i = 0;i < strlen(p);i++){
        lhp += int(p[i]);
    }
    lhp -= j.length();
    while (lhp < 0){
        lhp += 1000;
    }
    while (lhp < 50){     //生命值玄学算法 
        lhp += 25;
    }
    while (lhp > 350){
        lhp -= 124;
    }
    s[i].HP = lhp;

    int t_sr = rand() % 150;//临时随机数种子数组随机下标
    int s_op = rand() % 100;//攻随机数1
    srand(sr_d[t_sr]);//设置临时随机数
    int s_oi = rand() % 100;//攻随机数2
    lhp = lhp + s_op + s_oi;
    lhp %= strlen(p);  //攻玄学算法 
    while (lhp <= 10){
        lhp += 1000; 
    }
    while (lhp > 100){
        lhp -= 43;
    }
    lhp *= 14;
    while (lhp > 100){
        lhp -= 43;
    }
    s[i].At = lhp;
    srand(33529); 

    t_sr = rand() % 150;//临时随机数种子数组随机下标
    s_op = rand() % 100;//防随机数1
    srand(sr_d[t_sr]);//设置临时随机数
    s_oi = rand() % 100;//防随机数2
    lhp = lhp + s_op - s_oi * 8;
    while (lhp <= 10){
        lhp += 1000; 
    }
    while (lhp > 100){
        lhp -= 43;
    }
    lhp *= 13;
    while (lhp > 100){
        lhp -= 43;
    }
    s[i].Pt = lhp;
    srand(33529);
    t_sr = rand() % 150;//临时随机数种子数组随机下标
    s_op = rand() % 100;//速随机数1
    srand(sr_d[t_sr]);//设置临时随机数
    s_oi = rand() % 100;//速随机数2
    lhp = lhp + s_op - s_oi * 3;
    while (lhp <= 10){
        lhp += 1000; 
    }
    while (lhp > 100){
        lhp -= 43;
    }
    lhp *= 13;
    while (lhp > 100){
        lhp -= 43;
    }
    s[i].Sp = lhp;
}
void in(string j){
    for (int i = 0;;i++){
        cin >> j;
        if (i <= 1 && j == "end"){
            cout << "结束错误！" << endl;
            in("doing");
        }if (j == "end"){
            off_in_i = i;
            say("名字输好了,现在准备开始竞技吧!");    
            start_game();
            break; 
        }else{
            s[i].name = j;
            fz(j,i);
        }
    }
}

void start(){
    system("cls");
    cout << "1.开始游戏  2.游戏介绍  3.排名榜  4.更新日志  其他的键默认开始游戏"<<endl;
    int mc;
    cin >> mc;
    if(mc == 2){
        system("cls");
        say("名字竞技场 是一款基于文本的对战游戏。是十年前Flash游戏 MD5大作战 的续作。e玩法：在文本框中输入几个名字点击开始就可以进入战斗，之后不需要任何操作，战斗的过程和结果由输入的名字直接决定。每次输入相同的名字都会得到相同结果，即使改变名字的顺序结果也不会变。e属性和技能e同一个名字在不同的战斗中会以相同的属性出现，掌握的技能也一样。要在对战中取胜，关键是要找到一个足够强大的名字。e组队战e通常情况下每行输入一个名字，所有名字进行混战。e但如果在名字中加入空行，则会以空行分隔进行分组队战。e1.属性说明e2.技能列表e3.命名规则e4.特殊名字e5.测号技巧e按其他的推出介绍e");
        int n;
        cin >> n;
        if(n == 1){
            say("e属性:e攻e决定物理攻击的攻击力，包括普通攻击和物理攻击技能。e少量影响物理攻击的命中率。e防e决定物理攻击的防御力，包括普通攻击和物理攻击技能。e少量影响物理攻击的回避率。e速e速度决定了每轮行动的间隔时间e敏e决定了所有攻击的命中率和受到攻击的回避率e魔e决定魔法攻击的攻击力，包括普通攻击和物理攻击。e少量影响魔法攻击的命中率。e抗e决定魔法攻击的防御力，包括普通攻击和物理攻击技能。e少量影响魔法攻击的回避率。e智e整体上决定技能的使用频率。e当魔法攻击力高于物理攻击时，决定普通攻击出现魔攻的概率。e物理攻击力更高，普通攻击永远使用物理攻击计算，智力不起作用。e决定了战斗中对手的选择算法，高智力会偏好攻击体力较低的对手。e");
        }
        if(n == 2){
            say("技能列表:e技能分类：ee主动技能，在轮到自己的回合使用，伤害对手，部分伴随着附带效果。e辅助技能，在轮到自己的回合使用，仅有特殊效果但不造成伤害。e被动技能，满足特定条件时发动，不占用自己的回合。ee技能列表：ee攻击技能       属性     伤害ee连击           物理    75% x (2 ~ 3)e连击           连续多次攻击，若击中同一目标，后续伤害下降15%e会心一击     物理      145%e会心一击       稳定输出伤害，随机性低e火球术         魔法      137%e球术           若多次受到火系伤害，每次伤害增加25%e冰冻术           魔法      70%e冰冻术         命中后冰冻对手半回合e雷击术          魔法      35% x (3 ~ 6)e雷击术           对单一目标多次伤害e地裂术           魔法    140% ~ 200%e地裂术           将伤害平分给 1~5个目标，人数越多则单体伤害越小，但总伤害越大e吸血攻击       魔法      115%e吸血攻击       命中后吸收一半体力e狂暴术           魔法      80%e狂暴术         命中后施加狂暴状态，下回合只能进行敌我不分的狂暴攻击e诅咒           魔法      100%e诅咒         命中后施加诅咒状态，之后受到其他攻击随机出现伤害加倍效果e净化         魔法      100%e净化         命中后去除目标身上所有有益效果，对召唤兽伤害加倍e投毒         魔法      90%e投毒          命中后施加中毒状态，每回合损失体力e潜行        魔法      500e潜行          耗费两回合，第一回合潜行，第二回合背刺，中途受到伤害则潜行被打断e净化         魔法      100%e净化         命中后去除目标身上所有有益效果，对召唤兽伤害加倍e瘟疫         魔法      无e瘟疫        目标按比例损失体力50% ~ 99%。e生命之轮    魔法      无ee辅助技能     说明e瘟疫           目标体力值互换e聚气          攻击力提高60%e蓄力         下回合结束前伤害提升到300%，各种主动技能的特殊效果都有加成e魅惑          命中后 目标下回合行动会将施法者视作队友e加速术        自己或队友速度加倍，持续3回合e减速术         目标速度减半，持续2回合e铁壁         两回合内防御大幅上升e治愈术      回复自己或队友的体力，并去除异常状态e苏生术          复活一名被击倒的队友e血祭           召唤使魔，使魔受到伤害时施法者连带受到50%伤害e幻影         召唤幻影，幻影体力低，两回合后开始行动e分身          分成两人，分身后属性下降，技能不变eee被动技能    发动条件      说明ee反击        受到伤害      回合结束后向对手进行物理攻击e防御         受到伤害      进行防御，伤害减半e伤害反弹    受到攻击      将伤害反弹到施法者e守护          队友受到攻击    进行守护代替伤害，伤害减半e护身符         被击倒       复活自己并恢复少量体力e垂死抗争      受到伤害      当所剩体力极少，所有属性上升e护盾         每回合       恢复少量的护盾，受到伤害时护盾抵消一部分伤害e召唤亡灵       击倒对手      将对手的尸体变成丧尸为自己战斗e吞噬        击倒对手      吞噬对手提高自己的属性，并获得对手的技能e");
        }
        cout << "按任意键继续";
        while(1){
            if( kbhit()){
                start();
                break;
            }
        }
    }
    if(mc == 4){
        cout << "排名榜" << endl;
        cout << "排名    谁   为啥排上" << endl;
        cout << "1.   Zhoumy   写代码" << endl;
        cout << "1.   ZhanPJ   提供提纲和帮助Zhoumy（获得成就：大佬）" << endl;
        cout << "1.   cxqghzj      又写了一个版本" << endl;
        cout << "按任意键继续";
        while(1){
            if( kbhit()){
                start();
                break;
            }
        }
    }
    if(mc == 5){
        cout << "0.1 加入了初始....未写完" << endl;
        while(1){
            if(kbhit()){
                start();
                break;
            }
        }
    }
}
int main(){
    srand(33529);//使用一个5位质数作为随机数种子
    system("title 名字竞技场"); // 调整名字 
    system("mode con cols=78 lines=25");    //调整框大小
    start(); 
    system("cls");
    printf("-------------------------------名字竞技场------------------------------------\n");
    say("欢迎来到名字竞技场!");
    say("现在是写名字时刻!");
    say("最多可以写10个名字,最少得写2个!");
    printf("终止可以输入:end\n");
    in("doing");
    srand(33529);
    return 0;
}

