//题目网址: http://oi.nks.edu.cn/zh/Problem/Details/3902
#include <iostream>
using namespace std;
int main(){ 
	int n,e;
	cin >> n;
	int a[n][n] = {0};
	for(int i = 0;i < n;i++){
		e = e + i;
	}
	if(e%2==1) cout << "-1";
	else cout << e/2;
	return 0;
} 
/*
 评测说明 : 时间限制1s，空间限制128m 
 --------------------------------------------
 问题描述
 何老板在一个n*n的方格棋盘的对角线上放了n颗棋子。每次操作，他可以任意选两颗棋子组合成一对，让它们同时往下移动一格，但棋子不能走出棋盘。何老板想知道，最少操作几次就能把所有棋子都移动到棋盘的底边。
 --------------------------------------------
 输入格式
 一格整数n(1<=n<=10000)
 --------------------------------------------
  输出格式
 一行，一格整数，表示所需最小步数。如果无解，输出-1
 --------------------------------------------
 样例输入 1
4
样例输出 1
3
---------------------------------------------
样例输入 2
2
样例输出 2
-1
---------------------------------------------
样例输入 3
9
样例输出 3
18
*/
