 //神兽勿删
 // ━━━━━━神兽出没━━━━━━
 // 　　  ┏┓    ┏┓
 // 　　┏┛┻━━┛┻┓
 // 　　┃　　　　　  ┃
 // 　　┃            ┃
 // 　　┃┳┛┗┳    ┃
 // 　　┃　　　　　  ┃
 // 　　┃　┻　　　  ┃
 // 　　┃　　　　　  ┃
 // 　　┗━┓　　　┏┛　Code is far away from bug with the animal protecting
 // 　　　  ┃　　　┃    神兽保佑,代码无bug
 //   　　  ┃　　　┃
 //   　　  ┃　　　┗━━━┓
 // 　      ┃　　　　　　  ┣┓
 // 　　　  ┃　　　　　　  ┏┛
 // 　　　　┗┓┓┏━┳┓┏┛
 // 　　　　  ┃┫┫  ┃┫┫
 // 　　　　  ┗┻┛  ┗┻┛
 // 　　　　　　　  ┏┓　　┏┓
 // 　　　　　　　┏┛┻━━┛┻┓
 // 　　　　　　　┃　　　　　　┃
 // 　　　　　　　┃　　    　　┃
 // 　　　　　　　┃   Q   　Q　┃
 // 　　　　　　　┃　　　　　　┃
 // 　　　　　　　┃      W     ┃
 // 　　　　　　　┃　　　　　　┃
 // 　　　　　　　┗━┓　　　┏┛
 // 　　　　　　　　  ┃　　　┃　Code is far away from bug with the animal protecting　　　　　　　　　　
 // 　　　　　　　　  ┃　　　┃   神兽保佑,代码无bug
 // 　　　　　　　　  ┃　　　┃　　　　　　　　　　　
 // 　　　　　　　　  ┃　　　┃  　　　　　　
 //  　　　　　　　　 ┃　　　┃
 // 　 　　　　　　　 ┃　　　┃　　　　　　　　　　　
 // 　　 　　　　　　 ┃　　　┗━━━┓
 // 　　　 　　　　　 ┃　　　　　　　┣┓
 // 　　　　 　　　　 ┃　　　　　　　┏┛
 // 　　　　　 　　　 ┗┓┓┏━┳┓┏┛
 // 　　　　　　 　 　　┃┫┫　┃┫┫
 // 　　　　　　　 　 　┗┻┛　┗┻┛









#include <bits/stdc++.h>
using namespace std;

int main(){
	//地址的偏移 
	int a[3] = {5,9,6};
	int* p = &a[0];
	p++;//加4个字节 
	cout <<*p<<endl;//nine 
	return 0;
}



//     *(1+a) = a[1] = *(a+1) = 1[a]





/*

指针进行swap效果 

#include <bits/stdc++.h>
using namespace std;

void s(int* m,int* n){
	int t = *m;
	*m = *n;
	*n = t;
}

int main(){
	int a = 2,b = 3;
	s(&a,&b);
	cout << a << b; 
	
	
	
	
	return 0;
}


*/
